feat: remove sdd useless info
Change-Id: Ic7d08668ca56a758265a909927d6b0f48b4e5011
